Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/prison_system/supports_for_families_of_prisoners.html.txt.tmx
Source language: en
Languages: ga

source: Supports for families of prisoners
ga: Tacaí do theaghlach príosúnach

source: While there is no national organisation with sole responsibility for providing information or support to families affected by imprisonment, there are some voluntary organisations that do
ga: Cé nach bhfuil aon eagraíocht náisiúnta a bhfuil freagracht aonair as faisnéis nó tacaíocht a chur ar fáil do theaghlaigh a dtéann príosúnacht i bhfeidhm orthu, tá roinnt eagraíochtaí deonacha a dhéanann amhlaidh

source: The Irish Penal Reform Trust (IPRT) is a non-governmental organisation that campaigns for the rights of prisoners
ga: Eagraíocht neamhrialtasach a bhíonn i mbun feachtais ar son chearta na bpríosúnach is ea Iontaobhas na hÉireann um Athchóiriú an Chórais Choiriúil (IPRT)

source: It does not provide a service but on its website you can find a range of helpful publications and information for prisoners and their families
ga: Ní chuireann sé seirbhís ar fáil ach ar a láithreán gréasáin, is féidir raon foilseachán cabhrach agus faisnéis do phríosúnaigh agus dá dteaghlach a fháil

source: It also has contact details of organisations that provide advice and/or assistance to prisoners and former prisoners, and their friends and families
ga: Chomh maith leis sin, cuimsíonn sé sonraí teagmhála eagraíochtaí a chuireann comhairle agus/nó cabhair ar fáil do phríosúnaigh agus d’iarphríosúnaigh, agus dá gcairde agus dá dteaghlach freisin

source: In 2012 it published "Picking Up the Pieces": The Rights and Needs of Children and Families Affected by Imprisonment
ga: In 2012, d’fhoilsigh sé “Picking Up the Pieces”: The Rights and Needs of Children and Families Affected by Imprisonment

source: St Nicholas Trust is a Cork-based organisation that offers help and support to anybody affected by imprisonment – in particular the families of prisoners
ga: Eagraíocht atá lonnaithe i gCorcaigh a thairgeann cabhair agus tacaíocht d’aon duine a dtéann príosúnacht i bhfeidhm air, go háirithe do theaghlach príosúnach, is ea Iontaobhas Naomh Nioclás

source: Bedford Row Family Project is based in Limerick and supports family members affected by the imprisonment of one or more of their family
ga: Tá Tionscadal Teaghlaigh Rae Bedford lonnaithe i Luimneach agus tacaíonn sé le daoine muinteartha a dtéann príosúnacht ball amháin nó níos mó ná ball amháin dá teaghlach i bhfeidhm orthu

source: Clondalkin Addiction Support Programme (CASP) has produced a series of videos on visiting prison for families
ga: Thairg Clár Tacaíochta Andúile Chluain Dolcáin sraith físeán faoi chuairt a thabhairt ar phríosún do theaghlaigh
